RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
/*
 * Flock Companion - universal ESP32 Wi-Fi sniffer for the Flipper Zero
 * "Recon Site Survey" app.
 *
 * Runs on ANY ESP32 board exposed to the Flipper UART (Marauder hardware,
 * ReksLab Tri-Board, bare WROVER/WROOM, Xiao ESP32-S3, DevKitC, ...).
 * Puts the radio in promiscuous monitor mode, hops channels 1-13 (plus the 28
 * 5 GHz channels on an ESP32-C5, which has a dual-band radio), and reports
 * frames that look like Flock Safety / ALPR surveillance gear (by OUI, by
 * phone-home probe behaviour, and by SSID naming) over the serial link in a
 * simple line protocol the Flipper parses.
 *
 * Detection method and OUI list are from the open-source counter-surveillance
 * projects (colonelpanichacks/flock-you, 0xXyc/flock-you-wifi-recon,
 * nitekry/nite-oui-collection) and the DeFlock community. Passive recon only --
 * no deauth, no injection.
 *
 * Build: Arduino IDE or arduino-cli with the esp32 core. Select your board,
 * set Serial baud to 115200. No extra libraries required.
 *
 * Line protocol (newline-terminated, ASCII), TX to Flipper:
 *   FLOCKCO,1                              banner / version on boot and on "ver"
 *   S,<frames>,<hits>,<ch>,<deauth_rate>   status, ~1 Hz (deauth/disassoc per interval)
 *   D,<mac>,<rssi>,<ch>,<type>,<conf>,<ssid>[,fp=<hex32>][,cls=a][,hid=1]  detection
 *       mac : aabbccddeeff (lower hex, no separators)
 *       rssi: signed dBm
 *       ch  : 1-13 (2.4 GHz), or 36-177 (5 GHz, ESP32-C5 only)
 *       type: P=probe-req  B=beacon  R=probe-resp  O=other
 *       conf: 1=possible 2=likely 3=confirmed (ESP-side score)
 *       ssid: raw SSID with ',' and control chars stripped (may be empty)
 *       fp  : FNV-1a uint32 (8 lower-hex) of the probe's IE skeleton (B1) --
 *             a MAC-independent device-CLASS fingerprint; trailing field,
 *             older parsers ignore it. Only emitted for probe requests.
 *       cls : device class. 'a' = SoundThinking acoustic sensor. Absent means
 *             ALPR camera, so the common case adds no bytes. Trailing.
 *       hid : the AP beaconed WITHOUT an SSID (zero-length or all-NUL IE).
 *             Beacons/probe-responses only. An observation the Flipper reports
 *             but does NOT score -- hiding an SSID is also ordinary consumer
 *             router behaviour. Trailing, only emitted when true.
 *
 *       All three trailing key=value fields are optional and order-independent.
 *       Add one and you must also grow the field array in esp_parser.c.
 *   BLE,<addr>,<rssi>,<cat>,<company>,<name>[,<mfghex>][,rv=1]   BLE device
 *       cat   : 0 unknown 1 Flock/Raven 2 AirTag 3 Tile 4 SmartTag 5 FMDN
 *       mfghex: raw mfg-data hex (Flock 0x09C8 only) for serial decode; pure
 *               hex, no '='. Trailing, older parsers ignore.
 *       rv=1  : the device exposed a Raven-specific GATT service (0x3100-
 *               0x3500) -> positive acoustic-sensor (Raven) identification.
 *               Trailing, contains '=' so it's distinguishable from mfghex;
 *               only emitted when matched, older parsers ignore.
 *   DA,<bssid>,<ch>                        deauth/disassoc attack target (attributed)
 *   ATK,<kind>,<value>                     active attack-tool signature
 *       kind : probeflood  (abnormal probe-request rate)
 *              beaconflood (many DISTINCT beaconing BSSIDs/s: Marauder/Pineapple)
 *              blespam     (Apple/Samsung/Google pairing-advert flood)
 *       value: the count/rate measured. New line; older app builds ignore it.
 *   LOC,<rssi>                             Locator: live RSSI of the active target
 *                                          (signed dBm), streamed while homing.
 *   BAND,<2g|5g|all>,<channels>            ACK for the `band` command: the band
 *                                          actually in force and how many
 *                                          channels the sweep now covers. On a
 *                                          2.4-only radio this always answers
 *                                          2g, whatever was asked -- claiming
 *                                          5 GHz coverage the chip cannot
 *                                          provide would be a lie on the wire.
 *
 * RX from Flipper (commands, newline-terminated):
 *   scan   start reporting        stop   pause reporting
 *   ver    re-send banner         ch <n> lock to channel n (0 = hop)
 *   band <2g|5g|all>         pick which band(s) the hopper sweeps (C5 only;
 *                            a 2.4-only radio always ends up on 2g)
 *   locate <w|b> <mac> [ch]  stream LOC for a target (w=Wi-Fi, b=BLE; mac is
 *                            aabbccddeeff). "locate off" (or any other command)
 *                            ends Locator mode.
 */

#include <Arduino.h>
#include <stdarg.h> // buf_appendf()
#include "esp_wifi.h"
#include "esp_event.h"
#include "nvs_flash.h"

#include <BLEDevice.h>
#include <BLEScan.h>
#include <BLEAdvertisedDevice.h>

#include <string>

/* ---- Arduino-ESP32 core 2.x / 3.x compatibility ---------------------------
 *
 * Core 3.x (IDF 5.x) changed the BLE API in ways that break compilation
 * outright, not subtly. Reported by @h00die (issue #4) on core 3.3.11, which is
 * what a fresh Arduino install gets TODAY -- so before this shim, anyone
 * following our own README hit a wall of errors. Our CI pinned 2.0.17, so it
 * never saw any of it. A pin is not portability; it just hides the question.
 *
 * The three breaks:
 *
 *   1. BLEScan::start(secs, bool) returns BLEScanResults* in 3.x, by value in 2.x.
 *   2. getManufacturerData() / getName() / BLEUUID::toString() /
 *      BLEAddress::toString() return Arduino String in 3.x, std::string in 2.x.
 *   3. BLEAddress::getNative() returns const uint8_t* in 3.x, but uint8_t(*)[6]
 *      in 2.x -- so the 2.x code deref'd it once and 3.x gave back a single byte.
 *
 * Normalised to std::string here because the detection logic below does
 * substring work (find/rfind) that reads clearly in std::string and would have
 * to be rewritten for String. Conversion is LENGTH-PRESERVING on purpose:
 * manufacturer data is binary and can contain NUL bytes, so it is rebuilt with
 * the (pointer, length) constructor rather than treated as a C string -- a
 * strlen-style copy would silently truncate an advert at its first zero byte and
 * lose the Flock 0x09C8 payload we decode serials from.
 *
 * ESP_ARDUINO_VERSION_MAJOR is absent on very old cores; treat absent as 2.x.
 */
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
#define FLOCK_ARDUINO3 1
#else
#define FLOCK_ARDUINO3 0
#endif

