RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
/** i-th channel of the current sweep (2.4 GHz first, then 5 GHz). */
static uint8_t hop_channel(uint16_t i) {
    bool do_24 = (g_band == FlockBand2G || g_band == FlockBandAll);
#if FLOCK_HAS_5GHZ
    bool do_5 = (g_band == FlockBand5G || g_band == FlockBandAll);
#else
    bool do_5 = false;
#endif
    if(do_24) {
        if(i < MAX_HOP_CHANNEL) return (uint8_t)(i + 1);
        i -= MAX_HOP_CHANNEL;
    }
#if FLOCK_HAS_5GHZ
    if(do_5 && i < CHANNELS_5G_COUNT) return CHANNELS_5G[i];
#else
    (void)do_5;
#endif
    return 1;
}
static uint32_t g_last_status = 0;
static uint32_t g_last_hop = 0;
static uint32_t g_deauths_last = 0; // for per-interval deauth rate
static uint32_t g_last_da = 0; // rate-limit DA attribution lines

// ---- Active attack-tool detection (emitted as ATK lines, ~1 Hz) -----------
// These are RATE signals reset every status interval, so the alert clears when
// the attack stops. Thresholds are deliberately conservative to avoid false
// positives in dense-but-benign RF; tune for your environment.
//   probeflood : abnormal probe-request rate (KARMA / mass-probe tools)
//   beaconflood: many DISTINCT beaconing BSSIDs/s (Marauder/Pineapple SSID spam)
//   blespam    : a flood of impersonation BLE adverts (Flipper/ESP BLE spam)
#define PROBE_FLOOD_MIN  80 // probe requests in one ~1 s interval
#define BEACON_FLOOD_MIN 40 // distinct beaconing BSSIDs in one ~1 s interval
#define BLE_SPAM_MIN     12 // impersonation-class adverts in one BLE scan
static volatile uint32_t g_probe_reqs = 0; // probe requests this interval (reset ~1 Hz)
#define BEACON_RING 64
static uint32_t g_beacon_ring[BEACON_RING]; // recent beacon-BSSID hashes this interval
static uint8_t g_beacon_ring_n = 0;
static uint32_t g_beacon_distinct = 0; // distinct beaconing BSSIDs this interval

// Note a beacon's source BSSID; counts it once per interval. Approximate by
// design (a small ring + best-effort across the WiFi-callback / loop tasks) --
// it only needs to tell "a handful of real APs" from "a spam flood."
static void note_beacon_bssid(const uint8_t* bssid) {
    uint32_t h = 2166136261u; // FNV-1a over the 6 BSSID bytes (inlined: no fwd dep)
    for(int i = 0; i < 6; i++) {
        h ^= bssid[i];
        h *= 16777619u;
    }
    // The scan and the append must see the SAME g_beacon_ring_n: it is both the
    // dedup bound and the write index, and loop() zeroes it from the other core
    // every status interval. Hash outside the lock, hold it only for the ring.
    portENTER_CRITICAL(&g_mux);
    for(uint8_t i = 0; i < g_beacon_ring_n; i++) {
        if(g_beacon_ring[i] == h) { // already counted this interval
            portEXIT_CRITICAL(&g_mux);
            return;
        }
    }
    if(g_beacon_ring_n < BEACON_RING) {
        g_beacon_ring[g_beacon_ring_n++] = h;
        g_beacon_distinct++;
    }
    portEXIT_CRITICAL(&g_mux);
}

// ---- Locator: stream live RSSI for one target so the app can home in on it ---
// 'w' Wi-Fi (match the MAC in promiscuous frames, channel-locked) or 'b' BLE
// (match the addr in a repeating scan). MAC kept BOTH as bytes (Wi-Fi, compared
// to raw frame bytes) and as the lowercase hex string (BLE, compared to the
// same toString() form the BLE line is built from -- avoids byte-order traps).
// volatile: promisc_cb (WiFi task) reads g_locate_kind as the fast gate before
// touching the target. The target bytes themselves are swapped under g_mux.
static volatile char g_locate_kind = 0; // 0 none / 'w' / 'b'
static uint8_t g_locate_mac[6];
static char g_locate_macs[13]; // lowercase hex, no separators
static uint8_t g_locate_ch = 0;
static int g_locate_best = -127; // strongest RSSI since the last LOC emit (Wi-Fi)
static uint32_t g_last_loc = 0; // LOC emit throttle

static int hexv(char c) {
    if(c >= '0' && c <= '9') return c - '0';
    if(c >= 'a' && c <= 'f') return c - 'a' + 10;
    if(c >= 'A' && c <= 'F') return c - 'A' + 10;
    return -1;
}
static bool parse_hexmac(const char* s, uint8_t out[6]) {
    for(int i = 0; i < 6; i++) {
        int hi = hexv(s[i * 2]), lo = hexv(s[i * 2 + 1]);
        if(hi < 0 || lo < 0) return false;
        out[i] = (uint8_t)((hi << 4) | lo);
    }
    return true;
}

// Dual-band (WiFi + BLE) Flock detection. BLE is initialised once and kept
// resident (avoids the Bluedroid init/deinit heap leak); the radio is shared by
// toggling promiscuous off during a BLE scan, then back on. flockcombo
// interleaves a WiFi-promiscuous phase with a periodic BLE scan phase.
static bool g_ble_inited = false;
static BLEScan* g_ble = nullptr;
static bool g_combo = false;
static uint32_t g_phase_start = 0;
#define COMBO_WIFI_MS 9000 // ~3 channel sweeps before a BLE scan (WiFi-biased)
#define COMBO_BLE_SEC 3 // BLE scan seconds (BLE adverts repeat fast)

/**
 * First-byte rejection bitmap for the OUI tables.
 *
 * promisc_cb() tests TWO addresses on EVERY management frame, and each test used
 * to walk all 31 Flock prefixes plus the SoundThinking one -- up to 64 three-byte
 * comparisons per frame, inside the WiFi driver callback, before any filtering.
 * The overwhelming majority of frames match nothing.
 *
 * 256 bits (32 bytes) say whether ANY table entry starts with a given byte, so
 * the common no-match case costs one array index and one bit test. Built once at
 * boot by oui_index_init(); the tables are const, so it can never go stale.
 */
// Built during C++ static initialisation, i.e. before setup() and before any
// frame can arrive. Deliberately NOT an init function called from setup():
// forgetting that call would make every OUI test return false and silently kill
// all detection, which is the worst possible failure mode for this app. Deriving
// the index from the tables in a constructor makes that unrepresentable.
static const struct OuiFirstIndex {
    uint8_t bits[32]; // bit b set => some prefix starts with byte b
    OuiFirstIndex() : bits{} {
        for(size_t i = 0; i < FLOCK_OUI_COUNT; i++) {
            uint8_t b = FLOCK_OUIS[i][0];
            bits[b >> 3] |= (uint8_t)(1u << (b & 7));
        }
        for(size_t i = 0; i < SOUNDTHINKING_OUI_COUNT; i++) {
            uint8_t b = SOUNDTHINKING_OUIS[i][0];
            bits[b >> 3] |= (uint8_t)(1u << (b & 7));
        }
    }
} g_oui_index;

static inline bool oui_first_possible(uint8_t b) {
    return (g_oui_index.bits[b >> 3] >> (b & 7)) & 1;
}

static bool flock_oui_match(const uint8_t* mac) {
    if(!oui_first_possible(mac[0])) return false; // fast reject, no table walk
    for(size_t i = 0; i < FLOCK_OUI_COUNT; i++) {
        if(mac[0] == FLOCK_OUIS[i][0] && mac[1] == FLOCK_OUIS[i][1] &&
           mac[2] == FLOCK_OUIS[i][2])
            return true;
    }
    return false;
}

static bool st_oui_match(const uint8_t* mac) {
    if(!oui_first_possible(mac[0])) return false; // fast reject, no table walk
    for(size_t i = 0; i < SOUNDTHINKING_OUI_COUNT; i++) {
        if(mac[0] == SOUNDTHINKING_OUIS[i][0] && mac[1] == SOUNDTHINKING_OUIS[i][1] &&
           mac[2] == SOUNDTHINKING_OUIS[i][2])
            return true;
    }
    return false;
}

