RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
// Any known surveillance-vendor prefix, either class. Scoring is class-agnostic;
// the class itself rides along in the `cls=` field.
static bool oui_match(const uint8_t* mac) {
    return flock_oui_match(mac) || st_oui_match(mac);
}

static char lc(char c) {
    return (c >= 'A' && c <= 'Z') ? (char)(c + 32) : c;
}

/**
 * True if `s` is EXACTLY "flock-" + 6 hex digits: the provisioning-AP name.
 *
 * Mirrors is_flock_provisioning_ssid() in helpers/flock_db.c -- keep the two in
 * step, same hand-sync rule as the OUI tables above.
 *
 * ANCHORED on purpose. This used to be a bare strstr(buf, "flock-"), which
 * confirmed every benign name that merely contained the substring:
 * "Flock-Guest", "Flock-Safety-Corp", "Flock-12345". The Flipper takes the
 * companion's conf verbatim on this path, so that went straight to the screen
 * as CONFIRMED. Those now fall through to the "likely" check below.
 *
 * `s` is already lower-cased by the caller, so only a-f need testing.
 */
static bool is_flock_provisioning_ssid(const char* s) {
    if(strncmp(s, "flock-", 6) != 0) return false;
    for(int i = 6; i < 12; i++) {
        char c = s[i]; // '\0' on a short SSID is not hex -> correctly rejected
        bool hex = (c >= '0' && c <= '9') || (c >= 'a' && c <= 'f');
        if(!hex) return false;
    }
    return s[12] == '\0'; // nothing may follow the 6 hex digits
}

// Returns: 0 none, 2 likely (flock/flck substring), 3 confirmed
// (^flock-[0-9a-f]{6}$ or the test_flck dev SSID, CVE-2025-59409)
static int ssid_score(const char* s, int len) {
    if(len <= 0) return 0;
    char buf[64];
    int n = len < 63 ? len : 63;
    for(int i = 0; i < n; i++) buf[i] = lc(s[i]);
    buf[n] = 0;
    if(is_flock_provisioning_ssid(buf) || strstr(buf, "test_flck")) return 3;
    if(strstr(buf, "flock") || strstr(buf, "flck")) return 2;
    return 0;
}

// Append up to `max` bytes of `s` into buf[*pos], stripping ',', CR, LF and control chars
// to '.' so the payload can't break the line protocol. Bounds-checked; advances *pos.
// Callers assemble a whole line in one buffer and emit it with a SINGLE Serial.write, so a
// line built in promisc_cb (WiFi task) can't interleave on the UART with loop()'s status
// lines -- a single HardwareSerial::write() is atomic w.r.t. the other task's writes.
static void buf_append_escaped(char* buf, size_t bufsz, size_t* pos, const char* s, int len, int max) {
    for(int i = 0; i < len && i < max && *pos + 1 < bufsz; i++) {
        char c = s[i];
        if(c == ',' || c == '\r' || c == '\n' || (uint8_t)c < 0x20) c = '.';
        buf[(*pos)++] = c;
    }
}

/**
 * Append a printf-formatted field at buf[*pos], clamping to the buffer.
 *
 * snprintf() returns what it WOULD have written, so the natural-looking
 * `pos += snprintf(buf + pos, sizeof(buf) - pos, ...)` overshoots `pos` past the
 * buffer on truncation. The NEXT call then computes `sizeof(buf) - pos` as a
 * size_t UNDERFLOW -- a huge length against an out-of-bounds pointer. Chained
 * appends must never accumulate the raw return value; this clamps instead.
 */
static void buf_appendf(char* buf, size_t bufsz, size_t* pos, const char* fmt, ...) {
    if(*pos + 1 >= bufsz) return; // no room for even one byte + NUL
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(buf + *pos, bufsz - *pos, fmt, ap);
    va_end(ap);
    if(n < 0) return; // encoding error
    size_t avail = bufsz - *pos - 1;
    *pos += ((size_t)n > avail) ? avail : (size_t)n;
}

// ---- B1: probe IE-fingerprint + sequence-number coalescer ----------------
//
// The whole OUI/SSID ladder collapses the day Flock randomizes the probe MAC.
// The probe *body* is MAC-independent: the ordered set of tagged Information
// Elements (supported rates, HT/VHT/HE caps, vendor-specific 0xDD OUI+type) is
// baked into the WiFi SoC driver and can't be scrambled without breaking
// 802.11. We hash that skeleton into a uint32 the Flipper compares against a
// curated table. This is a device-CLASS / firmware-stack match, NOT a unique
// device ID -- the Flipper reports it as a candidate class match only.
//
// We hash only the *skeleton* (tag id + length, plus the first OUI+type bytes
// of vendor-specific IEs), never per-frame variable contents, so the same probe
// template hashes identically regardless of the (possibly randomized) MAC.

#define FNV1A_OFFSET 0x811c9dc5u
#define FNV1A_PRIME 0x01000193u

static inline uint32_t fnv1a_u8(uint32_t h, uint8_t b) {
    return (h ^ b) * FNV1A_PRIME;
}

// FNV-1a over the IE skeleton of a probe request. `p` points at the frame body,
// `len` is the body length (FCS already removed). Tagged params start at byte
// 24 (probe request has no fixed params). For each IE we fold in (tag_id,
// length); for vendor-specific (0xDD) we also fold in up to the first 5 bytes
// (3-byte OUI + 1-2 type/subtype) -- enough to distinguish vendor IEs without
// shipping their variable payloads. Returns 0 if there are no parseable IEs.
static uint32_t ie_skeleton_hash(const uint8_t* p, int len) {
    uint32_t h = FNV1A_OFFSET;
    int off = 24; // tagged parameters begin here for a probe request
    bool any = false;
    while(off + 2 <= len) {
        uint8_t tag = p[off];
        uint8_t tlen = p[off + 1];
        if(off + 2 + tlen > len) break; // truncated IE -> stop
        h = fnv1a_u8(h, tag);
        h = fnv1a_u8(h, tlen);
        if(tag == 0xDD) { // vendor-specific: fold OUI + type (first 5 bytes)
            int n = tlen < 5 ? tlen : 5;
            for(int i = 0; i < n; i++) h = fnv1a_u8(h, p[off + 2 + i]);
        }
        any = true;
        off += 2 + tlen;
    }
    return any ? h : 0;
}

// Sequence-number-run coalescer. A MAC-cycling Flock burst sprays many probes
// from different (randomized) MACs but with a *contiguous* 802.11 sequence
// number run -- the SoC's seq counter increments across the burst regardless of
// the source address. We treat such a run as ONE logical sighting and suppress
// the duplicates on the ESP side so they never flood the Flipper's 64-entry
// table. Keyed on the IE-skeleton hash so unrelated traffic with nearby seq
// numbers isn't merged.
#define SEQ_RUN_GAP 4 // max seq-num step to still count as the same burst
#define SEQ_RUN_MS 1500 // a run older than this is stale; start fresh
static uint32_t g_seq_fp = 0; // IE hash of the current run (0 = none)
static uint16_t g_seq_last = 0; // last 802.11 sequence number in the run
static uint32_t g_seq_t = 0; // millis() of the last frame in the run

