RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
// Returns true if this frame should be SUPPRESSED as a duplicate within an
// in-progress MAC-cycling burst (same IE fingerprint, monotonic seq-num run).
static bool seq_run_duplicate(uint32_t fp, uint16_t seq) {
    if(fp == 0) return false; // no fingerprint -> can't coalesce
    uint32_t now = millis();
    bool fresh = (now - g_seq_t) <= SEQ_RUN_MS;
    if(fresh && fp == g_seq_fp) {
        uint16_t step = (uint16_t)(seq - g_seq_last); // wraps mod 4096 naturally
        if(step != 0 && step <= SEQ_RUN_GAP) {
            g_seq_last = seq; // extend the run, suppress this frame
            g_seq_t = now;
            return true;
        }
    }
    // New run (or a gap too large / stale): this frame is the run's first
    // sighting -> report it and start tracking from here.
    g_seq_fp = fp;
    g_seq_last = seq;
    g_seq_t = now;
    return false;
}

static void promisc_cb(void* buf, wifi_promiscuous_pkt_type_t type) {
    if(type != WIFI_PKT_MGMT) return;
    const wifi_promiscuous_pkt_t* pkt = (const wifi_promiscuous_pkt_t*)buf;
    const uint8_t* p = pkt->payload;
    // sig_len includes the 4-byte FCS; drop it so SSID bounds checks stay inside
    // the actual frame body.
    int len = pkt->rx_ctrl.sig_len;
    if(len < 28) return;
    len -= 4;

    // Snapshot the channel now: the hopper may advance before we finish.
    uint8_t frame_channel = g_channel;

    g_frames++;

    uint8_t subtype = (p[0] >> 4) & 0x0F;

    // Active-attack rate sampling (counted on EVERY frame, before any Flock
    // candidacy filtering): probe-request floods and beacon-spam (many distinct
    // beaconing BSSIDs). Flushed/evaluated in the ~1 Hz status block.
    if(subtype == 0x04) {
        g_probe_reqs++; // probe request
    } else if(subtype == 0x08) {
        note_beacon_bssid(p + 16); // beacon: addr3 = BSSID
    }

    // Locator (Wi-Fi): track the strongest RSSI of any frame to/from the target
    // MAC (addr1/2/3). loop() emits it as a throttled LOC line.
    if(g_locate_kind == 'w') {
        int r = pkt->rx_ctrl.rssi;
        if(memcmp(p + 4, g_locate_mac, 6) == 0 || memcmp(p + 10, g_locate_mac, 6) == 0 ||
           memcmp(p + 16, g_locate_mac, 6) == 0) {
            if(r > g_locate_best) g_locate_best = r;
        }
    }

    // Deauthentication (0x0C) / disassociation (0x0A) frames: a flood of these
    // is the signature of a deauth attack or an evil-twin kicking clients off.
    if(subtype == 0x0C || subtype == 0x0A) {
        g_deauths++;
        // Attribution: report the targeted BSSID (addr3) + channel, rate-limited
        // so a heavy flood can't saturate the UART.
        uint32_t now_da = millis();
        if(now_da - g_last_da >= 250) {
            g_last_da = now_da;
            const uint8_t* b = p + 16; // addr3 = BSSID
            Serial.printf(
                "DA,%02x%02x%02x%02x%02x%02x,%u\n",
                b[0], b[1], b[2], b[3], b[4], b[5], frame_channel);
        }
    }

    char ftype = 'O';
    const char* ssid = NULL;
    int ssid_len = 0;

    // Locate SSID element (tag 0) within tagged parameters.
    int tag_off = -1;
    if(subtype == 0x04) { // probe request
        ftype = 'P';
        tag_off = 24;
    } else if(subtype == 0x08) { // beacon
        ftype = 'B';
        tag_off = 36;
    } else if(subtype == 0x05) { // probe response
        ftype = 'R';
        tag_off = 36;
    }
    bool ssid_ie_found = false;
    if(tag_off >= 0 && tag_off + 2 <= len && p[tag_off] == 0x00) {
        ssid_ie_found = true;
        ssid_len = p[tag_off + 1];
        if(tag_off + 2 + ssid_len <= len) {
            ssid = (const char*)(p + tag_off + 2);
        } else {
            // The IE claims more bytes than the frame holds -- a truncated or
            // malformed capture. Retract the whole finding, don't just zero the
            // length: leaving ssid_ie_found set made the all-NUL scan below pass
            // vacuously (zero bytes to disagree with it) and every truncated
            // frame got reported as a hidden network. A parse miss is not
            // evidence of concealment.
            ssid_ie_found = false;
            ssid_len = 0;
        }
    }

    // Hidden-SSID beaconing: an AP that advertises but withholds its name. Two
    // encodings are legal and both appear in the wild -- a zero-length SSID IE,
    // and a length-N IE of all NULs -- so test for both.
    //
    // Only meaningful for beacons and probe RESPONSES: those identify an AP. A
    // probe REQUEST with no SSID is an ordinary wildcard scan from a client and
    // says nothing about hiding. And we only claim "hidden" when the SSID IE was
    // actually located: a parse miss is not evidence of concealment.
    bool hidden = false;
    if(ssid_ie_found && (subtype == 0x08 || subtype == 0x05)) {
        hidden = true;
        for(int i = 0; i < ssid_len; i++) {
            if(ssid[i] != '\0') {
                hidden = false;
                break;
            }
        }
    }

    int s_score = ssid ? ssid_score(ssid, ssid_len) : 0;
    bool oui_tx = oui_match(p + 10); // addr2 = transmitter
    bool oui_rx = oui_match(p + 4); // addr1 = receiver (silent station)
    bool is_probe = (ftype == 'P');
    bool wildcard = is_probe && (ssid_len == 0); // broadcast/wildcard probe

    int conf = 0;
    if(s_score == 3)
        conf = 3; // confirmed Flock SSID name
    else if(oui_tx && wildcard)
        conf = 2; // OUI + wildcard probe -> only "likely": FLOCK_OUIS includes shared
                  // silicon-vendor ranges (e.g. Espressif), so any ESP32 device
                  // probing hits this. Reserve conf=3 for an SSID-name / IE-fp match.
    else if((oui_tx || oui_rx) && is_probe)
        conf = 2; // OUI (sender or silent receiver) + probe behaviour
    else if(s_score == 2)
        conf = 2;
    else if(oui_tx || oui_rx)
        conf = 1; // OUI prefix only

    if(conf == 0) return; // not a candidate; drop to keep UART quiet

    // B1: fingerprint the probe body (MAC-independent device-class signature)
    // and coalesce MAC-cycling bursts via the 802.11 sequence-number run, so a
    // randomized-MAC spray collapses to one logical sighting before it can flood
    // the Flipper's 64-entry table. Only probe requests carry a meaningful IE
    // skeleton. The coalescer runs only on candidate frames so unrelated noise
    // can't capture the run slot and suppress a real detection.
    uint32_t ie_fp = 0;
    if(is_probe) {
        ie_fp = ie_skeleton_hash(p, len);
        // 802.11 sequence control: bytes 22-23, seq number is the top 12 bits.
        uint16_t seq = ((uint16_t)p[23] << 8 | p[22]) >> 4;
        if(seq_run_duplicate(ie_fp, seq)) return; // duplicate in an active burst
    }

