RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
        // Apple/Tile/Samsung/Google pairing adverts are what BLE-spam tools
        // (Flipper "BLE spam", ESP32 sour-apple, etc.) impersonate in bulk. A few
        // are normal; a flood of them in one scan is the spam signature.
        if(cat == 2 || cat == 3 || cat == 4 || cat == 5) spam++;

        std::string a = fstr(d.getAddress().toString());
        char addr[13];
        int k = 0;
        for(size_t j = 0; j < a.size() && k < 12; j++) {
            if(a[j] != ':') addr[k++] = a[j];
        }
        addr[k] = 0;

        // One buffer + single write (same rationale as the D-line) so the multi-field
        // BLE line is emitted atomically.
        char line[176];
        size_t pos =
            snprintf(line, sizeof(line), "BLE,%s,%d,%d,%d,", addr, d.getRSSI(), cat, company);
        if(d.haveName()) {
            std::string nm = fstr(d.getName());
            buf_append_escaped(line, sizeof(line), &pos, nm.c_str(), (int)nm.size(), 32);
        }
        // Trailing field: raw mfg-data hex for Flock (0x09C8) only, so the
        // Flipper can decode the device serial. Capped so the line stays well
        // under the Flipper's RX line limit; only Flock units carry it.
        if(cat == 1 && company == 0x09C8 && d.haveManufacturerData()) {
            std::string md = fstr(d.getManufacturerData());
            if(pos + 1 < sizeof(line)) line[pos++] = ',';
            for(size_t j = 0; j < md.length() && j < 31 && pos + 2 < sizeof(line); j++) {
                buf_appendf(line, sizeof(line), &pos, "%02x", (uint8_t)md[j]);
            }
        }
        // Raven GATT flag, emitted LAST so it follows the optional mfghex field.
        // The '=' lets the Flipper distinguish it from the pure-hex mfghex token.
        if(raven && pos + 5 < sizeof(line)) {
            memcpy(line + pos, ",rv=1", 5);
            pos += 5;
        }
        if(pos > sizeof(line) - 1) pos = sizeof(line) - 1;
        line[pos++] = '\n';
        Serial.write((const uint8_t*)line, pos);
    }
    Serial.printf("BEND,%d\n", count);

    // A bulk of impersonation/pairing adverts in a single scan = a BLE-spam
    // flood (independent BLE radio class for the app's fused score).
    if(spam >= BLE_SPAM_MIN) Serial.printf("ATK,blespam,%d\n", spam);

    g_ble->clearResults();
    esp_wifi_set_promiscuous(true);
    set_channel(g_channel);
}

// Locator (BLE): one short scan; emit the target's RSSI if seen. Builds the same
// lowercased, colon-stripped toString() form the BLE line uses, so the comparison
// is byte-order-safe against the addr the app originally parsed.
static void ble_locate_scan() {
    ble_ensure_init();
    esp_wifi_set_promiscuous(false);
    BLEScanResults res = FLOCK_SCAN(g_ble, 1);
    int best = -127;
    int n = res.getCount();
    for(int i = 0; i < n; i++) {
        BLEAdvertisedDevice d = res.getDevice(i);
        std::string a = fstr(d.getAddress().toString());
        char addr[13];
        int k = 0;
        for(size_t j = 0; j < a.size() && k < 12; j++) {
            char c = a[j];
            if(c == ':') continue;
            addr[k++] = (c >= 'A' && c <= 'Z') ? (char)(c + 32) : c;
        }
        addr[k] = 0;
        if(strcmp(addr, g_locate_macs) == 0) {
            int r = d.getRSSI();
            if(r > best) best = r;
        }
    }
    g_ble->clearResults();
    if(best > -127) Serial.printf("LOC,%d\n", best);
}

void setup() {
    Serial.begin(115200);
    // Short RX timeout so loop()'s readStringUntil('\n') can't stall channel-hop /
    // heartbeat for the default 1 s when a command arrives without a trailing newline.
    Serial.setTimeout(20);
    delay(200);

    nvs_flash_init();
    esp_event_loop_create_default();
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    esp_wifi_init(&cfg);
    esp_wifi_set_storage(WIFI_STORAGE_RAM);
    esp_wifi_set_mode(WIFI_MODE_NULL);
    esp_wifi_start();
#if FLOCK_HAS_5GHZ
    // AUTO = 2.4 + 5. Must be set before hopping: with the default 2.4-only mode
    // a 5 GHz set_channel() is rejected and the sweep silently covers half of
    // what it reports. Non-fatal if it fails -- hop_channel() still yields valid
    // 2.4 GHz channels, so the companion degrades to the classic behaviour
    // instead of scanning nothing.
    if(esp_wifi_set_band_mode(WIFI_BAND_MODE_AUTO) != ESP_OK) {
        g_band = FlockBand2G;
    }
#endif
    start_promisc();

    banner();
}

static void handle_command(String cmd) {
    cmd.trim();
    // Any non-locate command ends Locator mode: unlock the Wi-Fi channel it
    // pinned, and restore promiscuous if BLE-locate had turned it off.
    if(!cmd.startsWith("locate")) {
        if(g_locate_kind == 'w') g_lock_channel = 0;
        if(g_locate_kind == 'b') {
            esp_wifi_set_promiscuous(true);
            set_channel(g_channel);
        }
        g_locate_kind = 0;
    }
    if(cmd == "scan") {
        g_scanning = true;
        g_combo = false; // pure WiFi Flock
    } else if(cmd == "stop") {
        g_scanning = false;
        g_combo = false; // also leave dual-band mode so the board goes idle
    } else if(cmd == "ver") {
        banner();
    } else if(cmd == "wifiscan") {
        wifi_security_scan();
    } else if(cmd == "blescan") {
        ble_do_scan(6);
    } else if(cmd == "flockcombo") {
        g_scanning = true;
        g_combo = true; // interleaved WiFi + BLE Flock detection
        g_phase_start = millis();
    } else if(cmd == "flockwifi") {
        g_combo = false;
    } else if(cmd.startsWith("ch ")) {
        int n = cmd.substring(3).toInt();
        // 1-14 are 2.4 GHz; 36-177 are the 5 GHz channels (C5 only). Anything
        // else, including 0, means "resume hopping".
        bool ok_24 = (n >= 1 && n <= 14);
        bool ok_5 = false;
#if FLOCK_HAS_5GHZ
        for(size_t i = 0; i < CHANNELS_5G_COUNT; i++) {
            if(n == CHANNELS_5G[i]) {
                ok_5 = true;
                break;
            }
        }
#endif
        if(ok_24 || ok_5) {
            g_lock_channel = (uint8_t)n;
            set_channel((uint8_t)n);
        } else {
            g_lock_channel = 0;
        }
    } else if(cmd.startsWith("band")) {
        // band 2g|5g|all -- pick which band(s) the hopper sweeps.
        // Always ACKs with the band actually in force, which on a 2.4-only chip
        // is 2g whatever was asked: silently accepting "5g" on a radio that has
        // no 5 GHz would report coverage that does not exist.
        String a = cmd.substring(4);
        a.trim();
#if FLOCK_HAS_5GHZ
        if(a == "5g")
            g_band = FlockBand5G;
        else if(a == "all")
            g_band = FlockBandAll;
        else if(a == "2g")
            g_band = FlockBand2G;
#else
        g_band = FlockBand2G;
#endif
        g_hop_i = 0;
        g_lock_channel = 0;
        set_channel(hop_channel(0));
        Serial.printf(
            "BAND,%s,%u\n",
            (g_band == FlockBand5G) ? "5g" : ((g_band == FlockBandAll) ? "all" : "2g"),
            (unsigned)hop_count());
    } else if(cmd.startsWith("locate")) {
        // locate <w|b> <hexmac> [ch]   -> stream LOC,<rssi> for that target
        // locate off                   -> stop
        if(cmd.indexOf("off") > 0) {
            if(g_locate_kind == 'b') {
                esp_wifi_set_promiscuous(true);
                set_channel(g_channel);
            }
            g_locate_kind = 0;
            g_lock_channel = 0;
        } else {
            int s1 = cmd.indexOf(' ');
            int s2 = (s1 > 0) ? cmd.indexOf(' ', s1 + 1) : -1;
            int s3 = (s2 > 0) ? cmd.indexOf(' ', s2 + 1) : -1;
            if(s1 > 0 && s2 > s1) {
                char kind = cmd.charAt(s1 + 1);
                String macs = (s3 > s2) ? cmd.substring(s2 + 1, s3) : cmd.substring(s2 + 1);
                macs.toLowerCase();
                uint8_t mac[6];
                if(macs.length() >= 12 && parse_hexmac(macs.c_str(), mac)) {
                    // promisc_cb() memcmp's g_locate_mac from the WiFi task, so a
                    // plain memcpy here can be observed half-applied and the
                    // Locator homes on a spliced old/new address. Swap the target
                    // and arm g_locate_kind together, under the lock -- kind is
                    // what gates the compare, so publishing it last inside the
                    // same section makes the whole target visible atomically.
                    portENTER_CRITICAL(&g_mux);
                    memcpy(g_locate_mac, mac, 6);
                    strncpy(g_locate_macs, macs.c_str(), 12);
                    g_locate_macs[12] = 0;
                    g_locate_kind = (kind == 'b') ? 'b' : 'w';
                    portEXIT_CRITICAL(&g_mux);
                    g_locate_ch = (s3 > s2) ? (uint8_t)cmd.substring(s3 + 1).toInt() : 0;
                    g_locate_best = -127;
                    g_scanning = false; // Locator dedicates the radio to one target
                    g_combo = false;
                    if(g_locate_kind == 'w') {
                        esp_wifi_set_promiscuous(true);
                        if(g_locate_ch >= 1 && g_locate_ch <= 14) {
                            g_lock_channel = g_locate_ch;
                            set_channel(g_locate_ch);
                        } else {
                            g_lock_channel = 0;
                        }
                    }
                }
            }
        }
    }
}

void loop() {
    if(Serial.available()) {
        handle_command(Serial.readStringUntil('\n'));
    }

