RogueMaster/flipperzero-firmware-wPlugins/applications/external/deflock/.esp32_companion/flock_companion/flock_companion.ino
    uint32_t now = millis();

    // Locator mode owns the radio: stream the target's live RSSI as LOC lines.
    if(g_locate_kind == 'w') {
        if(now - g_last_loc >= 120) {
            g_last_loc = now;
            if(g_locate_best > -127) {
                Serial.printf("LOC,%d\n", g_locate_best);
                g_locate_best = -127; // reset window; quiet interval = no LOC (out of range)
            }
        }
        return;
    }
    if(g_locate_kind == 'b') {
        ble_locate_scan(); // ~1 s blocking scan; emits LOC if the target is seen
        return;
    }

    // Dual-band: after a WiFi-promiscuous phase, run a BLE scan phase, then
    // resume. The BLE scan blocks for a few seconds and restores promiscuous.
    if(g_combo && now - g_phase_start >= COMBO_WIFI_MS) {
        ble_do_scan(COMBO_BLE_SEC);
        g_phase_start = millis();
        return;
    }

    // When not scanning, stay idle (no channel hopping, no status TX) so the
    // board isn't "in use" after the app stops/exits.
    if(!g_scanning) return;

    // Channel hop every 300 ms unless locked.
    //
    // 1-13, not 1-11. 12 and 13 are unusable for APs in the US, so the old bound
    // cost nothing there -- but they are ordinary channels across most of the
    // rest of the world, and a probe REQUEST is not bound by the same rule
    // anywhere. The price is ~18% less dwell per channel.
    //
    // 14 stays out: it is Japan-only, DSSS-only, and would burn dwell almost
    // everywhere to cover almost nothing.
    //
    // On a 5 GHz-capable radio the sweep also walks the 28 5 GHz channels -- see
    // the dual-band block near the top. The cursor is an index rather than
    // "current + 1" because the 5 GHz channel numbers are not contiguous.
    if(g_lock_channel == 0 && now - g_last_hop >= 300) {
        g_last_hop = now;
        uint16_t n = hop_count();
        g_hop_i = (uint16_t)((g_hop_i + 1) % n);
        set_channel(hop_channel(g_hop_i));
    }

    // Status heartbeat ~1 Hz. 4th field = deauth/disassoc frames in the LAST
    // interval (a rate, not a lifetime total) so the alert clears when a flood
    // stops. Older parsers ignore the extra field.
    if(now - g_last_status >= 1000) {
        g_last_status = now;
        uint32_t deauth_rate = g_deauths - g_deauths_last;
        g_deauths_last = g_deauths;
        Serial.printf("S,%u,%u,%u,%u\n", g_frames, g_hits, g_channel, deauth_rate);

        // Active attack-tool signatures for this interval, then reset the windows.
        // Snapshot and reset the beacon ring under the lock: note_beacon_bssid()
        // appends from the WiFi task using g_beacon_ring_n as its write bound, so
        // zeroing it outside the lock can race a half-finished append.
        portENTER_CRITICAL(&g_mux);
        uint32_t beacon_distinct = g_beacon_distinct;
        g_beacon_distinct = 0;
        g_beacon_ring_n = 0;
        portEXIT_CRITICAL(&g_mux);

        if(g_probe_reqs >= PROBE_FLOOD_MIN) Serial.printf("ATK,probeflood,%u\n", g_probe_reqs);
        if(beacon_distinct >= BEACON_FLOOD_MIN)
            Serial.printf("ATK,beaconflood,%u\n", beacon_distinct);
        g_probe_reqs = 0;
    }
}
